# LEGO Data Analysis - Rebrickable

This dataset was gotten from https://rebrickable.com/downloads/

The LEGO Parts/Sets/Colors and Inventories of every official LEGO set in the Rebrickable database is available for download as csv files here. These files are automatically updated daily. If you need more details, you can use the API which provides real-time data, but has rate limits that prevent bulk downloading of data

In [1]:
import pandas as pd
import numpy as np

#### Getting Data

In [11]:
sets = pd.read_csv(r'C:\Users\bolaj\Rebrickable\source\sets.csv')
sets.head()

  set_num                        name  year  theme_id  num_parts
0   001-1                       Gears  1965         1         43
1  0011-2           Town Mini-Figures  1979        67         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          0
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [10]:
themes = pd.read_csv(r'C:\Users\bolaj\Rebrickable\source\themes.csv')
themes.head()

   id            name  parent_id
0   1         Technic        NaN
1   3     Competition        1.0
2   4  Expert Builder        1.0
3  16      RoboRiders        1.0
4  17  Speed Slammers        1.0

#### Checking the datatypes

In [12]:
sets.dtypes

set_num      object
name         object
year          int64
theme_id      int64
num_parts     int64
dtype: object

In [13]:
themes.dtypes

id             int64
name          object
parent_id    float64
dtype: object

#### checking for null values

In [16]:
sets.isnull().sum()

set_num      0
name         0
year         0
theme_id     0
num_parts    0
dtype: int64

In [17]:
themes.isnull().sum()

id             0
name           0
parent_id    138
dtype: int64

#### Checking details of the data

In [18]:
sets.shape

(19378, 5)

In [19]:
themes.shape

(445, 3)

In [21]:
sets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19378 entries, 0 to 19377
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   set_num    19378 non-null  object
 1   name       19378 non-null  object
 2   year       19378 non-null  int64
 3   theme_id   19378 non-null  int64
 4   num_parts  19378 non-null  int64
dtypes: int64(3), object(2)
memory usage: 757.1+ KB

#### Merging our Data

In [23]:
data = pd.merge(sets, themes, how ='left', left_on='theme_id', right_on = 'id', suffixes=('_sets', '_themes'))

In [24]:
data.head()

,set_num,name_sets,year,theme_id,num_parts,id,name_themes,parent_id
0,001-1,Gears,1965,1,43,1,Technic,NaN
1,0011-2,Town Mini-Figures,1979,67,12,67,Classic Town,50.0
2,0011-3,Castle 2 for 1 Bonus Offer,1987,199,0,199,Lion Knights,186.0
3,0012-1,Space Mini-Figures,1979,143,12,143,Supplemental,126.0
4,0013-1,Space Mini-Figures,1979,143,12,143,Supplemental,126.0

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19378 entries, 0 to 19377
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   set_num      19378 non-null  object
 1   name_sets    19378 non-null  object
 2   year         19378 non-null  int64
 3   theme_id     19378 non-null  int64
 4   num_parts    19378 non-null  int64
 5   id           19378 non-null  int64
 6   name_themes  19378 non-null  object
 7   parent_id    8893 non-null   float64
dtypes: float64(1), int64(4), object(3)
memory usage: 1.3+ MB

#### Analysis

#### what is the total number of parts per theme?

In [47]:
#grouped the data by name_themes
parts_per_theme = data.groupby('name_themes').sum().reset_index()
#selected the columns I wanted to view
parts_per_theme =parts_per_theme[['name_themes', 'num_parts']].sort_values('num_parts', ascending=False)
parts_per_theme

        name_themes  num_parts
303         Technic     228199
292       Star Wars     224009
66   Creator Expert     132082
64          Creator     102357
209         Ninjago      96662
..              ...        ...
16         Aquazone         26
355         Zooters         25
229      Powered Up         19
340     Value Packs          1
6       Adventurers          0

[357 rows x 2 columns]